app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hekko"], ["summary", "q132retrt"], ["body", ""], ["created_at", "2018-08-17 06:52:31.622695"], ["updated_at", "2018-08-17 06:52:31.622695"]]
---
    def create
#        if check_nil
#            render :new
#        end
        @post = Post.new(post_params)
        if @post.save

UPDATE "posts" SET "title" = ?, "summary" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "dgf5"], ["summary", ""], ["body", ""], ["updated_at", "2018-08-17 16:31:13.722917"], ["id", 22]]
---
    def update
        if @post.update(post_params)